import numpy as np

# _x = (1/N)sum(Xi)
#  S = (1/(N-1))sum((Xi - _x)^2)
#  C = (1/(N-1))sum((Xi - _x)(Yi - _y))

a = [2, 1, 3]
# _x = (1/3)sum(2, 1, 3)
# C = S = (1/(3-1))sum((2-2)^2,(1-2)^2,(3-2)^2)
_a = (1 / 3) * (2 + 1 + 3)
a_c = (1 / (len(a) - 1)) * ((a[0] - _a) * (a[0] - _a) + (a[1] - _a) * (a[1] - _a) + (a[2] - _a) * (a[2] - _a))
print(a_c)
print(np.cov(a))

a = [[1, 2, 3], [2, 3, 4]]
# 求[1, 2], [2, 3], [3, 4]的协方差
print(np.cov(a, rowvar=False))
# 求[1, 2, 3], [2, 3, 4]的协方差
print(np.cov(a))

# 协方差矩阵计算的是不同维度之间的协方差，而不是不同样本之间的。
# 理解协方差矩阵的关键就在于牢记它计算的是不同维度之间的协方差，
# 而不是不同样本之间，拿到一个样本矩阵，我们要明确一行是一个样本
# 还是一个维度是一个样本。
